# 라이브러리 불러오기

In [2]:
import pandas as pd
menu = pd.Series(['비빔밥', '김치찌개', '된장찌개']) #Series : 일차원 리스트 생성
menu
price = pd.Series([10000, 9000, 8000])
price

display(menu,price)

# print(menu)
# print(price)

0     비빔밥
1    김치찌개
2    된장찌개
dtype: object

0    10000
1     9000
2     8000
dtype: int64

In [6]:
df_from_series = pd.DataFrame({
    '메뉴': menu,  #'key': series,
    '가격': price
})
df_from_series

     메뉴     가격
0   비빔밥  10000
1  김치찌개   9000
2  된장찌개   8000

In [3]:
df = pd.DataFrame({
    '메뉴': ['비빔밥', '김치찌개', '된장찌개'],
    '가격': [10000, 9000, 8000],
    '원산지': ['국내산', '국내산', '국내산']
})
df

     메뉴     가격  원산지
0   비빔밥  10000  국내산
1  김치찌개   9000  국내산
2  된장찌개   8000  국내산

In [9]:
#메뉴라는 key값을 전달하면 시리즈로 결과 도출!
menu_series = df['메뉴']     # 타입: pandas.Series
menu_series
# type(menu_series)

0     비빔밥
1    김치찌개
2    된장찌개
Name: 메뉴, dtype: object

In [12]:
menu_df = df[['메뉴']]       # 타입: pandas.DataFrame
menu_df 
# type(menu_df)

     메뉴
0   비빔밥
1  김치찌개
2  된장찌개

In [15]:
menu_price_df = df[['메뉴', '가격']]
menu_price_df

     메뉴     가격
0   비빔밥  10000
1  김치찌개   9000
2  된장찌개   8000

In [16]:
cols = ['메뉴', '가격']
menu_price_df2 = df[cols]
menu_price_df2

     메뉴     가격
0   비빔밥  10000
1  김치찌개   9000
2  된장찌개   8000

In [17]:
print('df          : ', type(df))
print("df['가격']   : ", type(df['가격']))     # Series
print("df[['가격']] : ", type(df[['가격']]))   # DataFrame

df          :  <class 'pandas.core.frame.DataFrame'>
df['가격']   :  <class 'pandas.core.series.Series'>
df[['가격']] :  <class 'pandas.core.frame.DataFrame'>

In [12]:
# 첫 번째 행(인덱스 0) 전체
row0 = df.loc[0]
# df
# row0 # 한 행만 꺼내오기


# # 인덱스 0~1 범위(끝 포함)
# rows_0_to_1 = df.loc[0:1]
# rows_0_to_1

# # 조건식: 가격이 9000 이상인 행
rows_price_ge_9000 = df.loc[df['가격'] >= 9000, ['메뉴', '가격']]
rows_price_ge_9000

     메뉴     가격
0   비빔밥  10000
1  김치찌개   9000

In [26]:
# 첫 번째 행(정수 위치 0)
# row0_iloc = df.iloc[0]
# row0_iloc

# 첫 2행(0,1)과 앞의 2개 컬럼(0,1)
sub_iloc = df.iloc[0:1, 0:3]
                    #행   #열(컬럼)
sub_iloc

    메뉴     가격  원산지
0  비빔밥  10000  국내산

In [27]:
# 예: 10% 할인 가격 컬럼 추가
df['할인가'] = (df['가격'] * 0.9).astype(int)
df

     메뉴     가격  원산지   할인가
0   비빔밥  10000  국내산  9000
1  김치찌개   9000  국내산  8100
2  된장찌개   8000  국내산  7200

In [32]:
# 예: '김치찌개' 가격 9500으로 변경
df.loc[df['메뉴'] == '김치찌개', '가격'] = 9500
df

     메뉴     가격  원산지   할인가
0   비빔밥  10000  국내산  9000
1  김치찌개   9500  국내산  8100
2  된장찌개   8000  국내산  7200

In [33]:
# 예: '할인가' 컬럼 삭제
df = df.drop(columns=['할인가']) #삭제 후 적용을 시켜줘야함
df

     메뉴     가격  원산지
0   비빔밥  10000  국내산
1  김치찌개   9500  국내산
2  된장찌개   8000  국내산

In [40]:

fruits = pd.Series(['사과','바나나','포도'])
fruits

0     사과
1    바나나
2     포도
dtype: object

In [41]:
df = pd.DataFrame({
    '상품': ['키보드','마우스','모니터',],
    '가격': [30000, 150000, 200000],
    '재고':[10, 25, 7]})
df

    상품      가격  재고
0  키보드  300000  10
1  마우스  150000  25
2  모니터  200000   7

In [42]:
product_series = df['상품']
product_series

0    키보드
1    마우스
2    모니터
Name: 상품, dtype: object

In [43]:
product_df = df[['상품']]
product_df

    상품
0  키보드
1  마우스
2  모니터

In [45]:
price_view = df [['상품','가격']]
price_view

    상품      가격
0  키보드  300000
1  마우스  150000
2  모니터  200000

In [49]:
over_200000 = df.loc[df['가격']>=200000, ['상품','가격']]
over_200000

    상품      가격
0  키보드  300000
2  모니터  200000

In [51]:
df.loc[df['상품'] == '마우스', '가격'] = 17000
df

    상품      가격  재고
0  키보드  300000  10
1  마우스   17000  25
2  모니터  200000   7

In [53]:
sub_iloc = df.iloc[0:2, 0:2]
sub_iloc

    상품      가격
0  키보드  300000
1  마우스   17000

In [54]:
df['부가세 포함 가격'] = (df['가격'] * 1.1).astype(int)
df

    상품      가격  재고  부가세 포함 가격
0  키보드  300000  10     330000
1  마우스   17000  25      18700
2  모니터  200000   7     220000